<template>
  <div>
    <city-header ></city-header>
    <city-search :allCity="allCity"></city-search>
    <city-list :allCity="allCity" :state="state" :letter="letter"></city-list>
    <city-alphabet @change="handleLetterChang"></city-alphabet>
  </div>
</template>

<script>
  import CityHeader from './components/Header.vue'
  import CitySearch from './components/Search.vue'
  import CityList from './components/List.vue'
  import CityAlphabet from './components/Alphabet.vue'

  export default{
  name:'City',
  components:{
    CitySearch,
    CityHeader,
    CityList,
    CityAlphabet
  },
    data(){
    return{
      letter:"",
      state:"",
      allCity:[
        {id:"A",city:["鞍山","安阳","安庆","安康","安顺"]},
        {id:"B",city:["包头","保定","宝鸡","滨州","蚌埠","本溪"]},
        {id:"C",city:["重庆","成都","长沙","长春","常州","沧州","承德","常德"]},
        {id:"D",city:["大连","东莞","德州","东营","大庆","大同","丹东","达州","大理"]},
        {id:"E",city:["鄂尔多斯","鄂州","恩施"]},
        {id:"F",city:["佛山","福州","抚顺", "阜阳", "阜新", "抚州", "防城港"]},
        {id:"G",city:["广州","贵阳","桂林"," 赣州","广安","广元","贵港"]},
        {id:"H",city:["杭州","哈尔滨","合肥","呼和浩特","海口","邯郸","菏泽","惠州","衡阳","衡水","湖州","黄石","黄冈","呼伦贝尔","汉中","黄山"]},
        {id:"J",city:["济南","吉林","嘉兴","金华","济宁","江门","揭阳","荆州","九江","焦作","佳木斯","晋中","晋城","吉安","嘉峪关","酒泉","景德镇"]},
        {id:"K",city:["昆明","开封","克拉玛依","喀什"]},
        {id:"L",city:["兰州","洛阳","柳州","临沂","聊城","廊坊","连云港","辽阳","临汾","六盘水","乐山","泸州","莱芜","漯河","拉萨"]},
        {id:"M",city:["绵阳","茂名","马鞍山","牡丹江","梅州","眉山"]},
        {id:"N",city:["南京","宁波","南昌","南宁","南通","南阳","南充","内江","宁德","南平"]},
        {id:"P",city:["平顶山","盘锦","莆田","濮阳","攀枝花","萍乡","平凉","普洱"]},
        {id:"Q",city:["青岛","泉州","衢州","齐齐哈尔","曲阜","秦皇岛","钦州"]},
        {id:"R",city:["日照","日喀则"]},
        {id:"S",city:["上海","深圳","沈阳","苏州","石家庄","三亚","韶关","十堰","商丘"]},
        {id:"T",city:["塔城", "台山", "台州", "太仓", "太原", "泰安", "泰兴", "泰州", "唐山", "洮南", "滕州", "天长", "天津", "天门", "天水", "铁法", "铁力", "铁岭", "通化", "通辽", "通什", "通州", "同江", "桐城", "桐乡", "铜川", "铜陵", "铜仁", "图们", "吐鲁番"]},
        {id:"W",city:["瓦房店", "畹町", "万宁", "万源", "威海", "潍坊", "卫辉", "渭南", "温岭", "温州", "文昌", "文登", "文水", "乌海", "乌兰浩特", "乌鲁木齐", "乌苏", "无锡", "吴川", "吴江", "吴县", "吴忠", "芜湖", "梧州", "五常", "五大连池", "武安", "武冈", "武汉", "武进", "武威", "武穴", "武夷山", "舞钢"]},
        {id:"X",city:["西安", "西昌", "西峰", "西宁", "锡林浩特", "锡山", "厦门", "仙桃", "咸宁", "咸阳", "湘潭", "湘乡", "襄樊", "项城", "萧山", "孝感", "孝义", "忻州", "辛集", "新乐", "新密", "新民", "新泰", "新乡", "新沂", "新余", "新郑", "信阳", "信宜", "兴城", "兴化", "兴宁", "兴平", "兴义", "邢台", "徐州", "许昌", "宣威", "宣州","香港"]},
        {id:"Y",city:["牙克石", "雅安", "烟台", "延安", "延吉", "盐城", "兖州", "偃师", "扬中", "扬州", "阳春", "阳江", "阳泉", "伊春", "伊宁", "仪征", "宜宾", "宜昌", "宜城", "宜春", "宜都", "宜兴", "宜州", "义马", "义乌", "益阳", "银川", "应城", "英德", "鹰潭", "荥阳", "营口", "永安", "永城", "永川", "永济", "永康", "永州", "余杭", "余姚", "榆次", "榆林", "榆树", "禹城", "禹州", "玉林", "玉门", "玉溪", "沅江", "原平", "岳阳", "云浮", "运城"]},
        {id:"Z",city:["枣阳", "枣庄", "增城", "扎兰屯", "湛江", "张家港", "张家界", "张家口", "张掖", "章丘", "漳平", "漳州", "樟树", "招远", "昭通", "肇东", "肇庆", "镇江", "郑州", "枝江", "中山", "重庆", "舟山", "周口", "株洲", "珠海", "诸城", "诸暨", "驻马店", "庄河", "涿州", "资兴", "资阳", "淄博", "自贡", "邹城", "遵化", "遵义"]},
      ],
    }
    },
    created(){
      this.state = this.$route.query.states;
//      console.log(this.state);
    },
    methods:{
      handleLetterChang(letter){
      console.log(letter)
      this.letter = letter
     }
    }
  }
</script>

<style lang="stylus">

</style>
